import 'package:flutter/material.dart';

// ignore: camel_case_types
class storyDetails {

  final String image , story , title ;
  final int id;
  final Color color;


  storyDetails({
    required this.id, 
    required this.image,
    required this.story,
    required this.color,
    required this.title,
  });


}

  List<storyDetails> storyD = [
    storyDetails(
      id: 0,
      image: 'monky.png', 
      story: "توی یک جنگل سبز، حیوانات زیادی زندگی می‌کردند. یکی از این روزا میمون کوچولوی قصه‌ی ما تک و تنها به جنگل سبز آمد. او هیچ کسی را نداشت. آدم‌ها پدر و مادرش را شکار کرده و به باغ وحش برده بودند. اما میمون کوچولو از دست آن‌ها فرار کرده بود. میمون کوچولوی قصه‌ی ما بسیار غمگین و ناراحت بود و تنهایی تو جنگل راه می‌رفت و می‌دید که بچه‌های حیوانات در کنار پدر و مادرشان هستند و همه با هم زندگی می‌کنند. میمون کوچولو خیلی غصه می‌خورد و با خودش می‌گفت: کاش پدر و مادرم اسیر نشده بودند و الان همه در کنار هم بودیم. میمون ما زیر درختی نشست و یهو سه تا میمون کوچولو را دید که با هم بازی می‌کردند و پدر و مادرشون مواظبشون بودند. میمون کوچولو با چشم‌های پر از اشک به آن‌ها نگاه می‌کرد. مادر میمون‌ها او را دید و به طرفش رفت و گفت: میمون کوچولو چرا ناراحتی؟ چرا چشمات پر از اشکه؟ میمون کوچولو جواب داد: آخه بابا و مامانم را گرفتند و به باغ وحش بردند. حالا من تنهام. خانم میمون آقای میمون را صدا زد و گفت: این میمون کوچولو تنهاست. من دوست دارم او را به خانه‌مان بیارم تا با بچه‌های ما بازی کنه. تو با این کار موافقی؟ آقای میمون که پدر مهربانی بود با خوشرویی گفت: بله که موافقم؛ و به میمون کوچولو گفت: تو هم بیا با ما زندگی کن. ما سه تا بچه داریم و تو هم می‌شی بچه‌ی چهارم ما. اون وقت ما یه خانواده شش نفری می‌شیم. چهار تا بچه با یک بابا و یک مامان. میمون کوچولو خوشحال شد و گفت: چه خوب! باشه منم میام با شما زندگی می‌کنم و عضو خانواده شما می‌شم. سه تا بچه میمون هم با دیدن میمون کوچولوی ما بسیار خوشحال شدند. آن‌ها میمون کوچولو را پیش خودشان بردند و به او آب و غذا دادند و وقتی میمون کوچولو سیر شد با آن‌ها بازی کرد و به خانه شان رفت. سه تا بچه میمون به او گفتند: خواهر کوچولو به خونه خودت خوش اومدی. از آن روز به بعد میمون کوچولو در کنار خواهر و برادر‌ها و پدر و مادر جدیدش زندگی می‌کرد و خوشحال بود که صاحب یک خانواده شده است. او هر روز دعا می‌کرد که پدر و مادرش بتوانند از باغ وحش فرار کنند و پیش او برگردند.!.", 
      color: Colors.orange.shade300, 
      title: 'خانواده‌ی میمون کوچولو'
    ),
    storyDetails(
      id: 1,
      image: 'elephant.png', 
      story: "یکی بود یکی نبود. یک روز یک فیل وارد یک جنگل شد و دنبال دوست می‌گشت. فیل قصه ما روی درخت یک میمون رو دید. ازش پرسید باهام دوست میشی؟ میمون بهش گفت تو خیلی گنده ای! تو نمیتونی مثل من از روی درخت بالا بری. آقا فیل داستان ما بعد از این یک خرگوش رو دید و ازش خواست که باهاش دوست بشه. اما خرگوش گفت تو خیلی گنده ای و نمیتونی داخل لونه من بازی کنی. فیل بعد از خرگوش، سراغ یک غورباقه رفت. بهش گفت باهام دوست میشی؟ غورباقه گفت مگه میشه؟! تو خیلی گنده ای و نمیتونی مثل من بپری. فیل داستان ما که ناراحت شده بود، به یک روباه رسید. ازش پرسید که باهاش دوست میشه یا نه که روباه گفت: ببخشید جناب! شما خیلی بزرگ هستید! روز بعد، فیل حیوانات رو داخل جنگل دید که دارن از دست کسی فرار می‌کنن ازشون با عجله پرسید چیشده؟ چرا فرار می‌کنین خرس گفت که یک ببر حیله گر داخل جنگله و میخواد هممون رو بخوره. حیوونا فرار کردن و پنهان شدن. فیل داشت فکر میکرد که چجوری می‌تونه جون حیوونا رو نجات بده که ناگهان، یک فکر بکر به سرش زد. تو این مدت ببر هر حیوونی رو سر راهش می‌دید می‌خورد فیل به سمت ببر حرکت کرد و گفت: جناب ببر، لطفا این حیوانات بی نوا رو نخورین! ببر بهش گفت: سرت به کار خودت باشه. فیل هیچ راهی نداشت جز این که بهش محکم حمله کنه! این کارو کرد و ببر به همین خاطر پا به فرار گذاشت. فیل به سمت جنگل برگشت و گفت که یک خبر خوب برای همه داره! همه حیوونای جنگل ازش تشکر می‌کردن. اونا گفتن: اندازه تو برای دوستی با ما کاملاً درسته!.", 
      color: Colors.indigo, 
      title: 'فیل تنها در جنگل'
    ),
    storyDetails(
      id: 2,
      image: 'pigeon.png', 
      story: "یکی بود یکی نبود. توی جنگل‌های شمال ایران، کنار یک رودخانه، درخت بزرگی قرار داشت که کبوتر پدر و کبوتر مادری با جوجه‌هایشان روی آن درخت زندگی می‌کردند. هر چه جوجه‌ها بزرگتر می‌شدند به غذای بیشتری نیاز داشتند. برای همین کبوتر مادر و پدر با هم به دنبال غذا می‌رفتند. یک روز که جوجه‌ها تنها مانده بودند، یک گنجشک قشنگ، پر زد و کنار لانه جوجه‌ها نشست. جوجه‌ها که تا به حال هیچ پرنده‌ای جز مادر و پدر خودشان ندیده بودند با دیدن گنجشک از ترس سرهایشان را زیر پرهایشان کردند و مثلا پنهان شدند. گنجشک گفت: چرا از من می‌ترسید؟ به من می‌گن گنجشک. منم بچه‌هایی مثل شما دارم و آمدم برایشان غذا پیدا کنم. آن‌ها کرم‌هایی که روی درخت شما هستند را خیلی دوست دارند. آن‌ها به گنجشک گفتند: چقدر تو زیبا هستی و چه قشنگ سریع بال می‌زنی و پرواز می‌کنی. گنجشک گفت: خداوند این بال‌های زیبا را به من داده تا با آن‌ها به هرجایی که می‌خواهم پرواز کنم و از نعمت‌های خدا برای خودم و بچه‌هایم غذا تهیه کنم. بعد از رفتن گنجشک و برگشتن پدر و مادر کبوتر، جوجه‌ها داستان را برای بابا و مامان تعریف کردند. فردای همان روز وقتی پدر و مادر کبوتر در حال رفتن به دنبال غذا بودند یک مرتبه دیدند عقابی به لانه‌ی گنجشک برای شکار گنجشک کوچولو‌ها حمله ور می‌شود. پدر و مادر جوجه‌ها خیلی سریع برای حفاظت از گنجشک‌ها فریاد زدند: خطررر خطرر؛ و در همان لحظه سگ مهربانی که روی شاخه بود خودش را روی لانه‌ی گنجشک‌ها انداخت و با پنجه‌های خود به بال‌های پرنده شکاری ضربه زد تا پرنده را دور کند. با این حرکت او عقاب تسلیم شد و پرواز کرد و رفت. وقتی گنجشک مادر برگشت همه برای او ماجرا را تعریف کردند. گنجشک مادر از کبوتر‌ها و سگ برای نجات جان بچه‌هایش بسیار تشکر کرد. سگ با اینکه کمی زخمی شده بود، ولی خوشحال بود که توانسته گنجشک کوچولو‌های همسایه را نجات بدهد. از جایش بلند شد و گفت: منم سه تا بچه دارم و دلم نمیخواد به خانواده‌ی عزیزم هیچ آسیبی برسه. برای همین از خانواده‌ی شما هم حفاظت کردم..", 
      color: Colors.green.shade300, 
      title: 'خانواده‌ی کبوتر'
    ),
    storyDetails(
      id: 3,
      image: 'leon.png', 
      story: "داخل یک جنگل، شیری زندگی می‌کرد. شیر قصه ما پیر شده بود و نمی‌تونست سریع بدوه. هر روزی که می‌گذشت شکار کردن براش سخت‌تر می‌شد .یک روز شیر وارد جنگل شد تا غذا پیدا کنه و به یک غار رسید. آروم به غار نزدیک شد و یک بویی از داخل غاز به مشامش خورد. وارد غار شد اما چیزی داخلش نبود. با خودش گفت که اینجا قایم میشم تا حیوونی که داخل غار بوده برگرده. اما اونجا خونه یک شغال بود. این شغال هر روز بعد از خوردن غذا به خونش برمیگشت. اما وقتی به غار نزدیک‌تر شد، فهمید یک مشکلی وجود داره. فضا ساکت ساکت بود. شغال به خودش گفت یک جای کار میلنگه! چرا همه  پرنده ها و حشره ها ساکتن؟ خیلی آروم و با احتیاط وارد غارش شد. دور و برش رو نگاه کرد و به دنبال نشونه ای از خطر بود. وقتی وارد دهانه غار شد، هوشش بهش هشدار خطر میداد. با خودش گفت: باید مطمئن بشم همه چی سر جاشه! یهو یک نقشه عالی به سرش خورد. شغال بلند گفت: سلام دوست من. اتفاقی افتاده؟ چرا اینقدر ساکتی؟ صدای شغال داخل غار پیچید. شیر که دیگه نمیتونست گرسنگیشو تحمل کنه با خودش گفت حتماً به خاطر منه که این غار ساکته و قبل از این که شغال بفهمه مشکلی وجود داره باید یک کاری کنم. شغال به حرف زدنش ادامه داد: قرارمون رو یادت رفته دوست عزیز؟ تو باید به من سلام کنی وقتی برمیگردم خونه. شیر صداش رو عوض کرد و گفت: به خونه خوش اومدی دوستم!  پرنده ها با صدای بلند جیر جیر کردن و با شنیدن صدای شیر فرار کردن. شغال هم همینطور. اون قبل از این که شیر یک لقمه چپش کنه، با سرعت تمام برای جان عزیزش فرار کرد. شیر زمان زیادی منتظر موند تا شغال وارد غار بشه اما وقتی شغال وارد نشد، شیر فهمید که کلاه سرش رفته. شیر از دست خودش عصبانی بود که حماقتش باعث شده یک غذای چرب و نرم از دستش دربره!.", 
      color: Colors.red.shade800, 
      title: 'شیر احمق'
    ),
    storyDetails(
      id: 4,
      image: 'rabbit.png', 
      story: "روزی و روزگاری، در جنگلی پر از درخت‌های سوزنی، چهار بچه خرگوش همراه مادرشان در حفره‌ای شنی زیر ریشه‌های یک درخت زندگی می‌کردند. اسم‌های آن‌ها، فلاپسی، ماپسی، دم پنبه‌ای و پیتر بود. یک روز صبح مامان خرگوشه گفت: عزیزان من، حالا شما می‌توانید بیرون بروید و در مزرعه‌ها بگردید ولی یادتان نرود که وارد باغ آقای مک نشوید. پدرتان هم در آن باغ دچار مشکل شده بود. بروید و بگردید ولی شیطونی نکنید. من هم می‌خواهم برای خرید بیرون بروم. سپس خانم خرگوشه سبد و چترش را برداشت و به جنگل رفت او می‌خواست از نانوائی، کمی نان و پنج عدد کلوچه کشمشی بخرد. فلاپسی و ماپسی و دم پنبه‌ای که کوچکتر بودند با هم پایین رفتند و به یک بوته توت جنگلی رسیدند. اما پیتر که شیطون و حرف گوش نکن بود بسمت باغ آقای مک دوید و از زیر در به داخل خزید. اول کمی کاهو خورد و بعد سراغ لوبیا و تربچه رفت. کمی که احساس ناراحتی و دل درد کرد، تصمیم گرفت چیز دیگری برای خوردن پیدا کند. اما در انتهای مزرعه خیار، آقای مک را دید. آقای مک که مشغول کاشتن بوته‌های خیار بود، با دیدن پیتر از جا پرید و در حالیکه شن کشش را در هوا تکان می‌داد، فریاد می‌زد: بایست‌ ای دزد! پیتر بدجوری ترسیده بود، او با سرعت به هر طرف می‌دوید ولی در ورودی را پیدا نمی‌کرد. یک لنگه کفشش در میان بوته‌های کلم از پایش در آمد و لنگه دیگر هم در میان گل‌ها گیر کرد. وقتی کفشهایش گم شدند او توقف نکرد و با سرعت بیشتری دوید. او می‌توانست فرار کند اگر بدشانسی نمی‌آورد و دکمه‌های لباسش به خار‌های توت‌ فرنگی گیر نمی‌کرد. آقای مک با یک الک در دستش، بالای سر خرگوش آمد. اما پیتر با یک حرکت ناگهانی از جا جنبید و در حالیکه کتش همانجا در بوته‌ها ماند، خودش را رها کرد و دوید. او داخل یک آبپاش پرید البته جای خوبی برای قایم شدن بود به شرط اینکه داخلش آبی نبود. آقای مک مطمئن بود که پیتر جایی در همان اطراف قایم شده است. او فکر کرد، شاید خرگوشک زیر گلدان‌ها قایم شده باشد. او با دقت شروع به گشتن کرد و زیر همه آن‌ها را یک به یک گشت. ناگهان پیتر عطسه‌ای کرد و آقای مک بدون اتلاف وقت به سراغش رفت. او سعی کرد پایش را روی پیتر بگذارد که پیتر از پنجره بیرون پرید و روی گلدان‌ها افتاد. پنجره خیلی کوچک بود و آقای مک نمی‌توانست از آن رد شود. پیتر کمی نشست تا استراحت کند. او به سختی نفس می‌کشید و از ترس می‌لرزید. چون توی آبپاش پریده بود، تنش خیس بود. بعد از مدتی او آهسته به راه افتاد، سلانه سلانه می‌رفت و اطرافش را نگاه می‌کرد تا ببیند چکار می‌تواند بکند. دری را دید که قفل بود و جایی هم برای عبور یک خرگوش چاق نبود. موش پیری که دانه‌ای را حمل می‌کرد به کنار در دوید. پیتر در مورد راه خروج سوال کرد ولی دانه‌ای که دهان موش بود اینقدر بزرگ بود که نمی‌توانست حرفی بزند و فقط سرش را تکان داد پیتر گریه اش گرفت. او به راه افتاد و سعی کرد راهی پیدا کند ولی هر چه می‌رفت بیشتر و بیشتر گیج می‌شد. او برگشت در حالیکه آرام و بی صدا حرکت می‌کرد. ناگهان صدای خراشیده شدن زمین توسط یک بیل را شنید. او زیر بوته‌ای خزید ولی هیچ اتفاقی نیفتاد. کم کم از جایش بیرون آمد و روی یک چرخ دستی که آن نزدیک بود پرید و همه چیز برایش قابل دیدن شد. اولین چیزی که دید آقای مک بود که خم شده بود و پیاز‌ها را از زمین بیرون می‌آورد. پشت او بطرف پیتر بود و آنطرفش هم در باغ بود.  پیتر از روی چرخ دستی پایین پرید و تا آنجا که توان داشت با سرعت به طرف در دوید؛ و از زیر در به بیرون از باغ رفت. پیتر توقف نکرد و بدون اینکه به پشت سرش نگاه کند به سمت خانه اش دوید. او اینقدر خسته بود که وقتی به خانه اش رسید روی کف نرم اتاق دراز کشید و چشمهایش را بست. مادرش مشغول پخت و پز بود. وقتی او را دید تعجب کرد که دوباره پیتر چه بلائی سر کت و کفشش آورده است. این دومین کت و کفشی بود که در طی دو هفته گذشته گمشان کرده بود. متأسفانه آن روز عصر حال پیتر خوب نبود. مادر او را به تختخوابش برد و برایش چای بابونه درست کرد و تا زمان خواب هر بار یک قاشق چای بابونه به او داد. اما فلاپسی، ماسی و دم پنبه‌ای برای شام نان تازه و شیر و توت جنگلی خوردند..", 
      color: Colors.blue.shade300, 
      title: 'چهار خرگوش کوچولو'
    ),
  ];

