import 'package:flutter/material.dart';

// ignore: camel_case_types
class storyDetails {

  final String image , story , title ;
  final int id;
  final Color color;


  storyDetails({
    required this.id, 
    required this.image,
    required this.story,
    required this.color,
    required this.title,
  });


}

  List<storyDetails> storyD = [
    storyDetails(
      id: 0,
      image: 'leon.png', 
      story: "برای من دلایل زیادی وجود دارد ولی 2 دلیل اصلی در اولویت من است.اولاً از لحاظ سطح علمی دانشگاه ها و کیفیت تدریسی ترکیه یک کشور ایده آل میباشد.خاصتاً از لحاظ رشته های تحصیلی که من انتخاب نمودم ترکیه از حمله بهترین ها میباشد.این برای من یک فرصت عالی میباشد تا بتوانم از این شرایط عالی تحصیلی استفاده نمایم تا در آینده بتوانم به کشورم خدمت کنم.دوماً فرهنگ و عنعنات مردم ترکیه برای من بسیار دلچسپ است. از آنجائیکه ترکیه یک کشور تاریخی میباشد  ومردم آن از جمله انسان های متدین و اصیل میاشند و کلا فرهنگ شان یک فرهنگ تاریخی است پس نسبت به بسیاری از کشور های دیگر برای من برتری دارد و نسبت به کشور های دیگر به محصلان و مهمانان کشور شان دیدی بهتری دارند.و این که ترکیه یک کشور اسلامی میباشد من میتوانم به راحتی هم به درس و هم دینم ادامه دهم که باز هم این از جمله مزیت های میباشد که ترکیه را انتخاب میکنم.", 
      color: Colors.orange.shade300, 
      title: 'ساطان جنگل شیر'
    ),
    storyDetails(
      id: 1,
      image: 'leon.png', 
      story: "برای من دلایل زیادی وجود دارد ولی 2 دلیل اصلی در اولویت من است.اولاً از لحاظ سطح علمی دانشگاه ها و کیفیت تدریسی ترکیه یک کشور ایده آل میباشد.خاصتاً از لحاظ رشته های تحصیلی که من انتخاب نمودم ترکیه از حمله بهترین ها میباشد.این برای من یک فرصت عالی میباشد تا بتوانم از این شرایط عالی تحصیلی استفاده نمایم تا در آینده بتوانم به کشورم خدمت کنم.دوماً فرهنگ و عنعنات مردم ترکیه برای من بسیار دلچسپ است. از آنجائیکه ترکیه یک کشور تاریخی میباشد  ومردم آن از جمله انسان های متدین و اصیل میاشند و کلا فرهنگ شان یک فرهنگ تاریخی است پس نسبت به بسیاری از کشور های دیگر برای من برتری دارد و نسبت به کشور های دیگر به محصلان و مهمانان کشور شان دیدی بهتری دارند.و این که ترکیه یک کشور اسلامی میباشد من میتوانم به راحتی هم به درس و هم دینم ادامه دهم که باز هم این از جمله مزیت های میباشد که ترکیه را انتخاب میکنم.", 
      color: Colors.indigo, 
      title: 'ساطان جنگل شیر'
    ),
    storyDetails(
      id: 2,
      image: 'monky.png', 
      story: "برای من دلایل زیادی وجود دارد ولی 2 دلیل اصلی در اولویت من است.اولاً از لحاظ سطح علمی دانشگاه ها و کیفیت تدریسی ترکیه یک کشور ایده آل میباشد.خاصتاً از لحاظ رشته های تحصیلی که من انتخاب نمودم ترکیه از حمله بهترین ها میباشد.این برای من یک فرصت عالی میباشد تا بتوانم از این شرایط عالی تحصیلی استفاده نمایم تا در آینده بتوانم به کشورم خدمت کنم.دوماً فرهنگ و عنعنات مردم ترکیه برای من بسیار دلچسپ است. از آنجائیکه ترکیه یک کشور تاریخی میباشد  ومردم آن از جمله انسان های متدین و اصیل میاشند و کلا فرهنگ شان یک فرهنگ تاریخی است پس نسبت به بسیاری از کشور های دیگر برای من برتری دارد و نسبت به کشور های دیگر به محصلان و مهمانان کشور شان دیدی بهتری دارند.و این که ترکیه یک کشور اسلامی میباشد من میتوانم به راحتی هم به درس و هم دینم ادامه دهم که باز هم این از جمله مزیت های میباشد که ترکیه را انتخاب میکنم.", 
      color: Colors.green.shade300, 
      title: 'ساطان جنگل شیر'
    ),
    storyDetails(
      id: 3,
      image: 'girl.png', 
      story: "برای من دلایل زیادی وجود دارد ولی 2 دلیل اصلی در اولویت من است.اولاً از لحاظ سطح علمی دانشگاه ها و کیفیت تدریسی ترکیه یک کشور ایده آل میباشد.خاصتاً از لحاظ رشته های تحصیلی که من انتخاب نمودم ترکیه از حمله بهترین ها میباشد.این برای من یک فرصت عالی میباشد تا بتوانم از این شرایط عالی تحصیلی استفاده نمایم تا در آینده بتوانم به کشورم خدمت کنم.دوماً فرهنگ و عنعنات مردم ترکیه برای من بسیار دلچسپ است. از آنجائیکه ترکیه یک کشور تاریخی میباشد  ومردم آن از جمله انسان های متدین و اصیل میاشند و کلا فرهنگ شان یک فرهنگ تاریخی است پس نسبت به بسیاری از کشور های دیگر برای من برتری دارد و نسبت به کشور های دیگر به محصلان و مهمانان کشور شان دیدی بهتری دارند.و این که ترکیه یک کشور اسلامی میباشد من میتوانم به راحتی هم به درس و هم دینم ادامه دهم که باز هم این از جمله مزیت های میباشد که ترکیه را انتخاب میکنم.", 
      color: Colors.red.shade800, 
      title: 'ساطان جنگل شیر'
    ),
    storyDetails(
      id: 4,
      image: 'leon.png', 
      story: "برای من دلایل زیادی وجود دارد ولی 2 دلیل اصلی در اولویت من است.اولاً از لحاظ سطح علمی دانشگاه ها و کیفیت تدریسی ترکیه یک کشور ایده آل میباشد.خاصتاً از لحاظ رشته های تحصیلی که من انتخاب نمودم ترکیه از حمله بهترین ها میباشد.این برای من یک فرصت عالی میباشد تا بتوانم از این شرایط عالی تحصیلی استفاده نمایم تا در آینده بتوانم به کشورم خدمت کنم.دوماً فرهنگ و عنعنات مردم ترکیه برای من بسیار دلچسپ است. از آنجائیکه ترکیه یک کشور تاریخی میباشد  ومردم آن از جمله انسان های متدین و اصیل میاشند و کلا فرهنگ شان یک فرهنگ تاریخی است پس نسبت به بسیاری از کشور های دیگر برای من برتری دارد و نسبت به کشور های دیگر به محصلان و مهمانان کشور شان دیدی بهتری دارند.و این که ترکیه یک کشور اسلامی میباشد من میتوانم به راحتی هم به درس و هم دینم ادامه دهم که باز هم این از جمله مزیت های میباشد که ترکیه را انتخاب میکنم.", 
      color: Colors.blue.shade300, 
      title: 'ساطان جنگل شیر'
    ),
  ];

